batchsize_experiment/log/gpu_0.95_v2_ttft_2000_tpot_50_20251112_125222/client_batchsize16_20251112_125334.log
/root/miniconda3/envs/openrlhf/lib/python3.10/site-packages/torch/cuda/__init__.py:63: FutureWarning: The pynvml package is deprecated. Please install nvidia-ml-py instead. If you did not install pynvml directly, please report this to the maintainers of the package that installed pynvml for you.
  import pynvml  # type: ignore[import]
INFO 11-12 12:53:38 [__init__.py:216] Automatically detected platform cuda.
Namespace(backend='vllm', base_url='http://127.0.0.1:8011', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, no_stream=False, max_concurrency=16, model='/root/.cache/huggingface/hub/Qwen2.5-7B-Instruct', tokenizer=None, use_beam_search=False, num_prompts=16, logprobs=None, request_rate=inf, burstiness=1.0, seed=42, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=['ttft:2000', 'tpot:50'], custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=512, random_output_len=1024, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=0.8, top_k=20, min_p=None, temperature=0.7, repetition_penalty=1.05, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, load_input_requests=None, save_input_requests=True)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf RPS.
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 16
100%|██████████| 16/16 [00:13<00:00,  1.17it/s]
============ Serving Benchmark Result ============
Successful requests:                     16        
Benchmark duration (s):                  13.63     
Total input tokens:                      8169      
Total generated tokens:                  16384     
Min_input_len:                           489.0     
Max_input_len:                           512.0     
Mean_input_len:                          510.5625  
P50_input_len:                           512.0     
P99_input_len:                           512.0     
Min_output_len:                          1024.0    
Max_output_len:                          1024.0    
Mean_output_len:                         1024.0    
P50_output_len:                          1024.0    
P99_output_len:                          1024.0    
Request throughput (req/s):              1.17      
Request goodput (req/s):                 1.17      
Output token goodput (tok/s):            1202.14   
Total token goodput (tok/s):             1801.52   
Output token throughput (tok/s):         1202.14   
Total Token throughput (tok/s):          1801.52   
---------------Time to First Token----------------
Mean TTFT (ms):                          284.41    
Median TTFT (ms):                        300.41    
P99 TTFT (ms):                           302.38    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          13.04     
Median TPOT (ms):                        13.03     
P99 TPOT (ms):                           13.23     
---------------Inter-token Latency----------------
Mean ITL (ms):                           13.04     
Median ITL (ms):                         12.99     
P99 ITL (ms):                            14.63     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          13624.78  
Median E2EL (ms):                        13625.64  
P99 E2EL (ms):                           13627.62  
==================================================